Revit 2024 API
IFrameworkElementCreator Interface
 Interface that the Revit UI will call, if present, to construct the FrameworkElement for the pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public interface IFrameworkElementCreator
Visual Basic
Public Interface IFrameworkElementCreator
Visual C++
public interface class IFrameworkElementCreator
Examples
CopyC#
//
// Class implementing the interface used in Revit to
// on demand create the pane UI.
//
internal class BrowserCreator : IFrameworkElementCreator
{
   //
   // Implement the creation call back by returning a
   // new WebBrowser each time the callback is triggered.
   //
   public FrameworkElement CreateFrameworkElement()
   {
      return new WebBrowser();
   }
}
CopyVB.NET
'
' Class implementing the interface used in Revit to
' on demand create the pane UI.
'
Friend Class BrowserCreator
    Implements IFrameworkElementCreator
    '
    ' Implement the creation call back by returning a
    ' new WebBrowser each time the callback is triggered.
    '
    Public Function CreateFrameworkElement() As FrameworkElement Implements IFrameworkElementCreator.CreateFrameworkElement
        Return New WebBrowser()
    End Function
End Class
See Also
IFrameworkElementCreator Members
Autodesk.Revit.UI Namespace